
a = input()

l = len(a)

multiples_of_ten = ['', '','सौ', 'हज़ार', 'हज़ार', 'लाख', 'लाख', 'करोड़', 'करोड़']

zero_to_99 = ['शून्य', 'एक', 'दो', 'तीन', 'चार', 'पांच', 'छह', 'सात', 'आठ', 'नौ', 'दस',
				'ग्यारह', 'बारह', 'तेरह', 'चौदह', 'पंद्रह', 'सोलह', 'सत्रह', 'अठारह', 'उन्नीस', 'बीस',
				'इकीस', 'बाईस', 'तेइस', 'चौबीस', 'पच्चीस', 'छब्बीस', 'सताइस', 'अट्ठाइस', 'उनतीस', 'तीस',
				'इकतीस', 'बतीस', 'तैंतीस', 'चौंतीस', 'पैंतीस', 'छतीस', 'सैंतीस', 'अड़तीस', 'उनतालीस', 'चालीस',
				'इकतालीस', 'बयालीस', 'तैतालीस', 'चवालीस', 'पैंतालीस', 'छयालिस', 'सैंतालीस', 'अड़तालीस', 'उनचास', 'पचास',
				'इक्यावन', 'बावन', 'तिरपन', 'चौवन', 'पचपन', 'छप्पन', 'सतावन', 'अठावन', 'उनसठ', 'साठ',
				'इकसठ', 'बासठ', 'तिरसठ', 'चौंसठ', 'पैंसठ', 'छियासठ', 'सड़सठ', 'अड़सठ', 'उनहतर', 'सत्तर',
				'इकहतर', 'बहतर', 'तिहतर', 'चौहतर', 'पचहतर', 'छिहतर', 'सतहतर', 'अठहतर', 'उन्नासी', 'अस्सी',
				'इक्यासी', 'बयासी', 'तिरासी', 'चौरासी', 'पचासी', 'छियासी', 'सतासी', 'अट्ठासी', 'नवासी', 'नब्बे',
				'इक्यानवे', 'बानवे', 'तिरानवे', 'चौरानवे', 'पचानवे', 'छियानवे', 'सतानवे', 'अट्ठानवे', 'निन्यानवे']

ans = ""

i = 0                               # Remove leading zeros
a = list(a)
while i<l and ord(a[i])==48:
	a[i] = ''
	i+=1

a = "".join(a)                     # Before decimal
b = ""                             # After decimal

if a.find('.') != -1:
	a,b = a.split('.')

l = len(a)
                                   # Process before decimal
if l>=1 and l<=2:
	ans = zero_to_99[int(a)] + " "

elif l>=3:
	x = 0
	while l-x > 3:
		if l%2==0 and x==0:      # pick first digit
			ans+=zero_to_99[int(a[x])] + " " + multiples_of_ten[l-x-1] + " "
			x+=1
		else:                    # pick in pairs
			tp = a[x] + a[x+1]
			if int(tp)!=0:
				ans+=zero_to_99[int(tp)] + " " + multiples_of_ten[l-x-1] + " "
			x+=2
                                 # Process last three digits
	if int(a[x])!=0:
		ans+=zero_to_99[int(a[x])] + " " + multiples_of_ten[l-x-1] + " "

	x+=1

	tp = a[x] + a[x+1]
	if int(tp)!=0:
		ans+=zero_to_99[int(tp)] + " "

                                 # Process after decimal
lb = len(b)

if lb != 0:
	ans+="दशमलव" + " "

	for i in range(lb):
		ans+=zero_to_99[int(b[i])] + " "

print(ans)


